GopalSaraf/Practicals/PSDL/include/proc/pic16lf1526.inc
// Register: CCP9CON
#define CCP9CON CCP9CON
CCP9CON                                  equ 061Ch
// bitfield definitions
CCP9CON_CCP9M_POSN                       equ 0000h
CCP9CON_CCP9M_POSITION                   equ 0000h
CCP9CON_CCP9M_SIZE                       equ 0004h
CCP9CON_CCP9M_LENGTH                     equ 0004h
CCP9CON_CCP9M_MASK                       equ 000Fh
CCP9CON_DC9B_POSN                        equ 0004h
CCP9CON_DC9B_POSITION                    equ 0004h
CCP9CON_DC9B_SIZE                        equ 0002h
CCP9CON_DC9B_LENGTH                      equ 0002h
CCP9CON_DC9B_MASK                        equ 0030h
CCP9CON_CCP9M0_POSN                      equ 0000h
CCP9CON_CCP9M0_POSITION                  equ 0000h
CCP9CON_CCP9M0_SIZE                      equ 0001h
CCP9CON_CCP9M0_LENGTH                    equ 0001h
CCP9CON_CCP9M0_MASK                      equ 0001h
CCP9CON_CCP9M1_POSN                      equ 0001h
CCP9CON_CCP9M1_POSITION                  equ 0001h
CCP9CON_CCP9M1_SIZE                      equ 0001h
CCP9CON_CCP9M1_LENGTH                    equ 0001h
CCP9CON_CCP9M1_MASK                      equ 0002h
CCP9CON_CCP9M2_POSN                      equ 0002h
CCP9CON_CCP9M2_POSITION                  equ 0002h
CCP9CON_CCP9M2_SIZE                      equ 0001h
CCP9CON_CCP9M2_LENGTH                    equ 0001h
CCP9CON_CCP9M2_MASK                      equ 0004h
CCP9CON_CCP9M3_POSN                      equ 0003h
CCP9CON_CCP9M3_POSITION                  equ 0003h
CCP9CON_CCP9M3_SIZE                      equ 0001h
CCP9CON_CCP9M3_LENGTH                    equ 0001h
CCP9CON_CCP9M3_MASK                      equ 0008h
CCP9CON_DC9B0_POSN                       equ 0004h
CCP9CON_DC9B0_POSITION                   equ 0004h
CCP9CON_DC9B0_SIZE                       equ 0001h
CCP9CON_DC9B0_LENGTH                     equ 0001h
CCP9CON_DC9B0_MASK                       equ 0010h
CCP9CON_DC9B1_POSN                       equ 0005h
CCP9CON_DC9B1_POSITION                   equ 0005h
CCP9CON_DC9B1_SIZE                       equ 0001h
CCP9CON_DC9B1_LENGTH                     equ 0001h
CCP9CON_DC9B1_MASK                       equ 0020h

// Register: CCPR10L
#define CCPR10L CCPR10L
CCPR10L                                  equ 061Dh
// bitfield definitions
CCPR10L_CCPR10L_POSN                     equ 0000h
CCPR10L_CCPR10L_POSITION                 equ 0000h
CCPR10L_CCPR10L_SIZE                     equ 0008h
CCPR10L_CCPR10L_LENGTH                   equ 0008h
CCPR10L_CCPR10L_MASK                     equ 00FFh

// Register: CCPR10H
#define CCPR10H CCPR10H
CCPR10H                                  equ 061Eh
// bitfield definitions
CCPR10H_CCPR10H_POSN                     equ 0000h
CCPR10H_CCPR10H_POSITION                 equ 0000h
CCPR10H_CCPR10H_SIZE                     equ 0008h
CCPR10H_CCPR10H_LENGTH                   equ 0008h
CCPR10H_CCPR10H_MASK                     equ 00FFh

// Register: CCP10CON
#define CCP10CON CCP10CON
CCP10CON                                 equ 061Fh
// bitfield definitions
CCP10CON_CCP10M_POSN                     equ 0000h
CCP10CON_CCP10M_POSITION                 equ 0000h
CCP10CON_CCP10M_SIZE                     equ 0004h
CCP10CON_CCP10M_LENGTH                   equ 0004h
CCP10CON_CCP10M_MASK                     equ 000Fh
CCP10CON_DC10B_POSN                      equ 0004h
CCP10CON_DC10B_POSITION                  equ 0004h
CCP10CON_DC10B_SIZE                      equ 0002h
CCP10CON_DC10B_LENGTH                    equ 0002h
CCP10CON_DC10B_MASK                      equ 0030h
CCP10CON_CCP10M0_POSN                    equ 0000h
CCP10CON_CCP10M0_POSITION                equ 0000h
CCP10CON_CCP10M0_SIZE                    equ 0001h
CCP10CON_CCP10M0_LENGTH                  equ 0001h
CCP10CON_CCP10M0_MASK                    equ 0001h
CCP10CON_CCP10M1_POSN                    equ 0001h
CCP10CON_CCP10M1_POSITION                equ 0001h
CCP10CON_CCP10M1_SIZE                    equ 0001h
CCP10CON_CCP10M1_LENGTH                  equ 0001h
CCP10CON_CCP10M1_MASK                    equ 0002h
CCP10CON_CCP10M2_POSN                    equ 0002h
CCP10CON_CCP10M2_POSITION                equ 0002h
CCP10CON_CCP10M2_SIZE                    equ 0001h
CCP10CON_CCP10M2_LENGTH                  equ 0001h
CCP10CON_CCP10M2_MASK                    equ 0004h
CCP10CON_CCP10M3_POSN                    equ 0003h
CCP10CON_CCP10M3_POSITION                equ 0003h
CCP10CON_CCP10M3_SIZE                    equ 0001h
CCP10CON_CCP10M3_LENGTH                  equ 0001h
CCP10CON_CCP10M3_MASK                    equ 0008h
CCP10CON_DC10B0_POSN                     equ 0004h
CCP10CON_DC10B0_POSITION                 equ 0004h
CCP10CON_DC10B0_SIZE                     equ 0001h
CCP10CON_DC10B0_LENGTH                   equ 0001h
CCP10CON_DC10B0_MASK                     equ 0010h
CCP10CON_DC10B1_POSN                     equ 0005h
CCP10CON_DC10B1_POSITION                 equ 0005h
CCP10CON_DC10B1_SIZE                     equ 0001h
CCP10CON_DC10B1_LENGTH                   equ 0001h
CCP10CON_DC10B1_MASK                     equ 0020h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

